###  Part # 2
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  ated%0A  + resource "aws_instance" "my_amazon4" {%0A      + ami                                  = "ami-05f408238af346b4f"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = "us-east-1a"%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t3.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "week6-prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-0f4bca516b17ac949"%0A      + tags                                 = {%0A          + "Name" = "week6-Amazon-Linux : dev Server 5"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "week6-Amazon-Linux : dev Server 5"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = true%0A          + device_name           = (known after apply)%0A          + encrypted             = false%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # module.webserver-dev.aws_instance.my_amazon5 will be created%0A  + resource "aws_instance" "my_amazon5" {%0A      + ami                                  = "ami-05f408238af346b4f"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = "us-east-1b"%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t3.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "week6-prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-09459968bb1bbe3eb"%0A      + tags                                 = {%0A          + "Name" = "week6-Amazon-Linux : dev Server 6"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "week6-Amazon-Linux : dev Server 6"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = true%0A          + device_name           = (known after apply)%0A          + encrypted             = false%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # module.webserver-dev.aws_key_pair.week6 will be created%0A  + resource "aws_key_pair" "week6" {%0A      + arn             = (known after apply)%0A      + fingerprint     = (known after apply)%0A      + id              = (known after apply)%0A      + key_name        = "week6-prod"%0A      + key_name_prefix = (known after apply)%0A      + key_pair_id     = (known after apply)%0A      + key_type        = (known after apply)%0A      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDvekTxnFlCjkhjvVEy1L+MZPzEFuk9Qd/pj7Iivlqy0luHJNGdFYVGhI7H2958TxeOo/piCg04Xq4kmccbfODsQ6fwJs1tM3NP94sLkFY41h1E9ZymztbP2Jz3g9KKfTcnn2l7Hz+MwoI2njTeRMWBAHOo8WTrlc8hBI9NeXRDYu2M6ghihqkUduHK7tJrsfSmU0woy9qmU4qPFy0hOfcJDLhSYMuFpu8OTnYkxQk3WbhDGTULrSmOkjDSTwodNK8hp4v6RvVKdlOyXvvQ6nJR2l4nYwjClz95DcKtQSZSXA/mpxnO5CT8tHvdat1/QsDIrQ4AEgJJgeX8jltbsCXB ec2-user@ip-172-31-22-166.ec2.internal"%0A      + tags_all        = (known after apply)%0A    }%0A%0A  # module.webserver-dev.aws_security_group.acs730w6 will be created%0A  + resource "aws_security_group" "acs730w6" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow HTTP and SSH inbound traffic"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "HTTP from everywhere"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "SSH from everywhere"%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 22%0A            },%0A        ]%0A      + name                   = "allow_http_ssh"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "App"   = "Web"%0A          + "Name"  = "week6-EBS"%0A          + "Owner" = "Sunil"%0A          + "env"   = "dev"%0A        }%0A      + tags_all               = {%0A          + "App"   = "Web"%0A          + "Name"  = "week6-EBS"%0A          + "Owner" = "Sunil"%0A          + "env"   = "dev"%0A        }%0A      + vpc_id                 = "vpc-0350181c2cc60fced"%0A    }%0A%0A  # module.webserver-dev.aws_security_group.private_sg will be created%0A  + resource "aws_security_group" "private_sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow SSH inbound traffic"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "SSH from everywhere"%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = (known after apply)%0A              + self             = false%0A              + to_port          = 22%0A            },%0A        ]%0A      + name                   = "allow_ssh"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "App"   = "Web"%0A          + "Name"  = "week6-EBS"%0A          + "Owner" = "Sunil"%0A          + "env"   = "dev"%0A        }%0A      + tags_all               = {%0A          + "App"   = "Web"%0A          + "Name"  = "week6-EBS"%0A          + "Owner" = "Sunil"%0A          + "env"   = "dev"%0A        }%0A      + vpc_id                 = "vpc-0350181c2cc60fced"%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @spk1999, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - staging`*